# LAB 2: Exploring Pandas

# Q1.

First, I install the pandas library

In [2]:
%pip install pandas

Requirement already satisfied: pandas in ./.venv/lib/python3.13/site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in ./.venv/lib/python3.13/site-packages (from pandas) (2.2.1)
Requirement already satisfied: python-dateutil>=2.8.2 in ./.venv/lib/python3.13/site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in ./.venv/lib/python3.13/site-packages (from pandas) (2024.2)
Requirement already satisfied: tzdata>=2022.7 in ./.venv/lib/python3.13/site-packages (from pandas) (2024.2)
Requirement already satisfied: six>=1.5 in ./.venv/lib/python3.13/site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

In [3]:
import numpy as np
import pandas as pd

Pandas helps read and manipulate data files

## Series
Series is a single column list

## Dataframe
Dataframe is a 2D table. This will be used more for adding and deleting rows and columns. Dataframe is a collection of series

In [4]:
s1 = pd.Series([1,2,4,-3]) # if I give differnt data types, then it will be assigned Object datatype
s1

0    1
1    2
2    4
3   -3
dtype: int64

In [5]:
s1[3]

np.int64(-3)

In [6]:
s1[3] = -7
s1

0    1
1    2
2    4
3   -7
dtype: int64

In [7]:
s1.values # returns nd array, it's an attribute

array([ 1,  2,  4, -7])

In [8]:
s1.index # returns range object

RangeIndex(start=0, stop=4, step=1)

In [9]:
# defining series with custom indices

In [10]:
s2 = pd.Series([4,7,5,0], index=['a', 'b', 'c', 'd'])
s2

a    4
b    7
c    5
d    0
dtype: int64

In [11]:
s2['a']

np.int64(4)

In [12]:
s2[['a', 'd']] # can't use colons here, use commas

a    4
d    0
dtype: int64

In [13]:
# boolean filtering
s2[s2>0]

a    4
b    7
c    5
dtype: int64

In [14]:
s1 * 2

0     2
1     4
2     8
3   -14
dtype: int64

In [15]:
np.sqrt(s2[s2>0]) # numpy accepts both series and dataframe

a    2.000000
b    2.645751
c    2.236068
dtype: float64

In [16]:
sdata = {'Ohio': 3240, 'Texas': 4320, 'Oregon': 6790, 'Utah': 8907}
s3 = pd.Series(sdata) # treats keys as indices and values as, well, values :)
s3

Ohio      3240
Texas     4320
Oregon    6790
Utah      8907
dtype: int64

In [17]:
l1 = ['Ohio','Texas','Oregon', 'Utah']
l2 = [3240, 4320, 6790, 8907]
s4 = pd.Series(l2, index=l1) # if I don't give index, then default index will be assigned
s4

Ohio      3240
Texas     4320
Oregon    6790
Utah      8907
dtype: int64

Index is itself also created as object

In [18]:
s4.name = 'Population'
s4.index.name  = 'State'
s4

State
Ohio      3240
Texas     4320
Oregon    6790
Utah      8907
Name: Population, dtype: int64

In [19]:
data = { 'state': ['Ohio', 'Ohio', 'Nevada', 'Utah'],
         'year': [2004,2001,2004,2005],
         'pop': [1.5, 1.7, 1.6, 1.1]} # DF of 3 columns
df1 = pd.DataFrame(data)
df1

    state  year  pop
0    Ohio  2004  1.5
1    Ohio  2001  1.7
2  Nevada  2004  1.6
3    Utah  2005  1.1

In [20]:
df2 = pd.DataFrame(df1, columns = ['year', 'state', 'pop']) # Changing names of columns
df2.melt

<bound method DataFrame.melt of    year   state  pop
0  2004    Ohio  1.5
1  2001    Ohio  1.7
2  2004  Nevada  1.6
3  2005    Utah  1.1>

In [21]:
df3 = pd.DataFrame(data, index=['a', 'b', 'c', 'd'])
df3

    state  year  pop
a    Ohio  2004  1.5
b    Ohio  2001  1.7
c  Nevada  2004  1.6
d    Utah  2005  1.1

While indexing, we can extract columns as series or sub-dataframe.

In [22]:

df3.year # series

a    2004
b    2001
c    2004
d    2005
Name: year, dtype: int64

In [23]:
df3['year'] # series

a    2004
b    2001
c    2004
d    2005
Name: year, dtype: int64

In [24]:
df4 = df3[['year']] # retrieves columns as Dataframe using double square brackets
df4

   year
a  2004
b  2001
c  2004
d  2005

Now, we extract rows using loc(for non-numeric indices) and iloc(for numeric indices)

In [25]:
df3.loc['d'] # converts as series but can extract only one row

state    Utah
year     2005
pop       1.1
Name: d, dtype: object

In [26]:
df3.year.loc['d'] # extracts single value, first accessing column then year

np.int64(2005)

In [27]:
df3.loc['d'].year # first accessing row then column

np.int64(2005)

In [28]:
df3.iloc[2] # all non-numeric indices are also hashed to numeric values

state    Nevada
year       2004
pop         1.6
Name: c, dtype: object

In [29]:
# df3.loc[2] # won't work
df1.loc[2]

state    Nevada
year       2004
pop         1.6
Name: 2, dtype: object

In [30]:
df3['debt'] = 0 # Adds or modifies all the values of column

In [31]:
df3

    state  year  pop  debt
a    Ohio  2004  1.5     0
b    Ohio  2001  1.7     0
c  Nevada  2004  1.6     0
d    Utah  2005  1.1     0

In [32]:
df3['debt_new'] = [90,56,78,34]
df3

    state  year  pop  debt  debt_new
a    Ohio  2004  1.5     0        90
b    Ohio  2001  1.7     0        56
c  Nevada  2004  1.6     0        78
d    Utah  2005  1.1     0        34

Axis 0 is top to bottom<br/>
Axis 1 is left to right

In [33]:
obj = pd.Series(np.arange(5), index=['a', 'b', 'c', 'd', 'e'])
obj

a    0
b    1
c    2
d    3
e    4
dtype: int64

In [34]:
val = obj.drop('e') # does not alter/modify original series/dataframe
# deletes entire row by default while seraching vertically for index name, 
# if axis=1 then delets column while seraching in the headers of column
val # New modified table is returned

a    0
b    1
c    2
d    3
dtype: int64

In [35]:
obj # not modified

a    0
b    1
c    2
d    3
e    4
dtype: int64

# Indexing

In [36]:
obj[0] # can access directly using numeric values witgout iloc in Series only, will depreciate

/var/folders/_8/stmfqx710clbn04z1vg4j8lr0000gn/T/ipykernel_849/2131736506.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  obj[0] # can access directly using numeric values witgout iloc in Series only, will depreciate

np.int64(0)

In [37]:
obj['a']

np.int64(0)

In [38]:
obj['b':'c'] # inclusive when we use numeric values in both Series and Dataframe

b    1
c    2
dtype: int64

In [39]:
obj[0:2] # not-inclusive of 2 in both Series and Dataframe

a    0
b    1
dtype: int64

# Arithmetic Operations
Aligns operations  on indices

In [40]:
s1 = pd.Series([7,7,7,7], index=['a','b','c','d'])
s2 = pd.Series([-2,3,4,1], index=['b','c','d','e'])
s1+s2 # or s1.add(s2)

a     NaN
b     5.0
c    10.0
d    11.0
e     NaN
dtype: float64

In [41]:
s1.add(s2, fill_value=0)

a     7.0
b     5.0
c    10.0
d    11.0
e     1.0
dtype: float64

In [42]:
np.nan # NaN data_type

nan

In [43]:
df = pd.DataFrame(np.arange(16).reshape((4,4)), columns=['one', 'two', 'three', 'four'], index=['Ohio','Nevada','Utah','Utah']) 
# index can be same here
df

        one  two  three  four
Ohio      0    1      2     3
Nevada    4    5      6     7
Utah      8    9     10    11
Utah     12   13     14    15

Original array remains same even after sorting

In [44]:
# rank() ranks indices based on order of values
s1 = pd.Series([-2,3,4,1], index=['a','b','c','d'])
s1.rank() # if two values are the same then we can use a tie-breaking rule here

a    1.0
b    3.0
c    4.0
d    2.0
dtype: float64

In [45]:
s1.rank(method='first') # what appears first is assigned first

a    1.0
b    3.0
c    4.0
d    2.0
dtype: float64

In [46]:
s1.rank() # default; assigns values as per average

a    1.0
b    3.0
c    4.0
d    2.0
dtype: float64

In DF, sorting takes place in terms of names of column and row headers<br/>
Using 'by' argument, we can use a different row/col for sorting.
skipna argument to skip NaN numbers. If we don't then because of any NaN value in column, the entire operation results in NaN
percentile means if 50% is 0.35 then 50% of the values are 0.35 or less than 0.35.

# Q2.

In [47]:
data = {'Location':['United States', 'India', 'Brazil', 'Russia', 'United Kingdom', 'France', 'Spain', 'Italy', 'Turkey', 'Germany'],
        'Cases': [28_833_039, 11_079_979, 10_517_232, 4_246_079, 4_170_519, 3_736_016, 3_188_553, 2_907_825, 2_693_164, 2_444_169],
        'Deaths': [517_204, 156_938, 254_263, 86_122, 122_705, 86_332,69_142,97_507,28_503,70_601],
        'Recovered':[np.nan,10_763_451,9_386_440,3_811_797,np.nan,np.nan,np.nan,2_398_352,2_565_723,2_242_767]}
df = pd.DataFrame(data)
df

         Location     Cases  Deaths   Recovered
0   United States  28833039  517204         NaN
1           India  11079979  156938  10763451.0
2          Brazil  10517232  254263   9386440.0
3          Russia   4246079   86122   3811797.0
4  United Kingdom   4170519  122705         NaN
5          France   3736016   86332         NaN
6           Spain   3188553   69142         NaN
7           Italy   2907825   97507   2398352.0
8          Turkey   2693164   28503   2565723.0
9         Germany   2444169   70601   2242767.0

# Q3.

In [48]:
df['Status'] = df['Cases']
df

         Location     Cases  Deaths   Recovered    Status
0   United States  28833039  517204         NaN  28833039
1           India  11079979  156938  10763451.0  11079979
2          Brazil  10517232  254263   9386440.0  10517232
3          Russia   4246079   86122   3811797.0   4246079
4  United Kingdom   4170519  122705         NaN   4170519
5          France   3736016   86332         NaN   3736016
6           Spain   3188553   69142         NaN   3188553
7           Italy   2907825   97507   2398352.0   2907825
8          Turkey   2693164   28503   2565723.0   2693164
9         Germany   2444169   70601   2242767.0   2444169

In [49]:
def helper(val):
    if val < 3_000_000: return 'low'
    elif  val >= 4_000_000: return 'high'
    else: return 'medium'

df['Status'] = df['Cases'].apply(helper)
df

         Location     Cases  Deaths   Recovered  Status
0   United States  28833039  517204         NaN    high
1           India  11079979  156938  10763451.0    high
2          Brazil  10517232  254263   9386440.0    high
3          Russia   4246079   86122   3811797.0    high
4  United Kingdom   4170519  122705         NaN    high
5          France   3736016   86332         NaN  medium
6           Spain   3188553   69142         NaN  medium
7           Italy   2907825   97507   2398352.0     low
8          Turkey   2693164   28503   2565723.0     low
9         Germany   2444169   70601   2242767.0     low

# Q4.

In [50]:
df['Deaths'].rank()

0    10.0
1     8.0
2     9.0
3     4.0
4     7.0
5     5.0
6     2.0
7     6.0
8     1.0
9     3.0
Name: Deaths, dtype: float64

# Q5.

In [51]:
df.describe()

              Cases         Deaths     Recovered
count  1.000000e+01      10.000000  6.000000e+00
mean   7.381658e+06  148931.700000  5.194755e+06
std    8.172197e+06  143366.103826  3.845493e+06
min    2.444169e+06   28503.000000  2.242767e+06
25%    2.978007e+06   74481.250000  2.440195e+06
50%    3.953268e+06   91919.500000  3.188760e+06
75%    8.949444e+06  148379.750000  7.992779e+06
max    2.883304e+07  517204.000000  1.076345e+07

In [52]:
df.idxmax()

Location     0
Cases        0
Deaths       0
Recovered    1
Status       5
dtype: int64

In [53]:
df.idxmin()

Location     2
Cases        9
Deaths       8
Recovered    9
Status       0
dtype: int64

In [54]:
df.sum()

Location     United StatesIndiaBrazilRussiaUnited KingdomFr...
Cases                                                 73816575
Deaths                                                 1489317
Recovered                                           31168530.0
Status               highhighhighhighhighmediummediumlowlowlow
dtype: object

In [57]:
df['Cases'].median(numeric_only=False)

np.float64(3953267.5)

In [58]:
df['Cases'].var()

np.float64(66784801015163.61)

In [59]:
df['Cases'].skew()

np.float64(2.4056930359341493)

In [60]:
df['Cases'].kurt()

np.float64(6.142259822548525)

In [62]:
df.cumsum()

,Location,Cases,Deaths,Recovered,Status
0,United States,28833039,517204,NaN,high
1,United StatesIndia,39913018,674142,10763451.0,highhigh
2,United StatesIndiaBrazil,50430250,928405,20149891.0,highhighhigh
3,United StatesIndiaBrazilRussia,54676329,1014527,23961688.0,highhighhighhigh
4,United StatesIndiaBrazilRussiaUnited Kingdom,58846848,1137232,NaN,highhighhighhighhigh
5,United StatesIndiaBrazilRussiaUnited KingdomFr...,62582864,1223564,NaN,highhighhighhighhighmedium
6,United StatesIndiaBrazilRussiaUnited KingdomFr...,65771417,1292706,NaN,highhighhighhighhighmediummedium
7,United StatesIndiaBrazilRussiaUnited KingdomFr...,68679242,1390213,26360040.0,highhighhighhighhighmediummediumlow
8,United StatesIndiaBrazilRussiaUnited KingdomFr...,71372406,1418716,28925763.0,highhighhighhighhighmediummediumlowlow
9,United StatesIndiaBrazilRussiaUnited KingdomFr...,73816575,1489317,31168530.0,highhighhighhighhighmediummediumlowlowlow

In [64]:
df.cummax()

        Location     Cases  Deaths   Recovered  Status
0  United States  28833039  517204         NaN    high
1  United States  28833039  517204  10763451.0    high
2  United States  28833039  517204  10763451.0    high
3  United States  28833039  517204  10763451.0    high
4  United States  28833039  517204         NaN    high
5  United States  28833039  517204         NaN  medium
6  United States  28833039  517204         NaN  medium
7  United States  28833039  517204  10763451.0  medium
8  United States  28833039  517204  10763451.0  medium
9  United States  28833039  517204  10763451.0  medium

In [66]:
df.cummin()

        Location     Cases  Deaths   Recovered Status
0  United States  28833039  517204         NaN   high
1          India  11079979  156938  10763451.0   high
2         Brazil  10517232  156938   9386440.0   high
3         Brazil   4246079   86122   3811797.0   high
4         Brazil   4170519   86122         NaN   high
5         Brazil   3736016   86122         NaN   high
6         Brazil   3188553   69142         NaN   high
7         Brazil   2907825   69142   2398352.0   high
8         Brazil   2693164   28503   2398352.0   high
9         Brazil   2444169   28503   2242767.0   high

In [72]:
df[['Cases','Deaths']].cumprod()

                 Cases               Deaths
0             28833039               517204
1      319469466626181          81168961352
2  2627076008664456880    20638263620243576
3  7683677728832826704  6521108426500297136
4 -3530367059382959568  8191788419739625648
5  6426695010879796992  2203555084571588928
6 -3145159625427226880  6546352681614863232
7  8329288016626499328  2525743648854594176
8 -6052080537096891392 -6370896385882158720
9  7311223601537315840 -4694990406290737792

In [73]:
df[['Cases','Deaths']].diff()

        Cases    Deaths
0         NaN       NaN
1 -17753060.0 -360266.0
2   -562747.0   97325.0
3  -6271153.0 -168141.0
4    -75560.0   36583.0
5   -434503.0  -36373.0
6   -547463.0  -17190.0
7   -280728.0   28365.0
8   -214661.0  -69004.0
9   -248995.0   42098.0

In [75]:
df[['Cases','Deaths']].pct_change()

      Cases    Deaths
0       NaN       NaN
1 -0.615719 -0.696565
2 -0.050790  0.620149
3 -0.596274 -0.661288
4 -0.017795  0.424781
5 -0.104184 -0.296426
6 -0.146537 -0.199115
7 -0.088042  0.410243
8 -0.073822 -0.707683
9 -0.092454  1.476967

# Q6.

In [101]:
df.loc[:4, 'Recovered'] = df.loc[:4, 'Recovered'].fillna(df['Recovered'].mean())
df.loc[4:, 'Recovered'] = df.loc[4:, 'Recovered'].fillna(df['Recovered'].median())

In [102]:
df

         Location     Cases  Deaths     Recovered  Status
0   United States  28833039  517204  4.596792e+06    high
1           India  11079979  156938  4.596792e+06    high
2          Brazil  10517232  254263  9.386440e+06    high
3          Russia   4246079   86122  4.596792e+06    high
4  United Kingdom   4170519  122705  5.194755e+06    high
5          France   3736016   86332  5.194755e+06  medium
6           Spain   3188553   69142  5.194755e+06  medium
7           Italy   2907825   97507  2.398352e+06     low
8          Turkey   2693164   28503  2.565723e+06     low
9         Germany   2444169   70601  2.242767e+06     low